redis_performance/5workers/redis-performance_with_stress.txt
====== PING_INLINE ======
  100000 requests completed in 2.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

69.54% <= 1 milliseconds
91.38% <= 2 milliseconds
97.06% <= 3 milliseconds
98.37% <= 4 milliseconds
99.20% <= 5 milliseconds
99.51% <= 6 milliseconds
99.74% <= 7 milliseconds
99.90% <= 8 milliseconds
99.95% <= 12 milliseconds
99.96% <= 13 milliseconds
99.97% <= 14 milliseconds
99.99% <= 16 milliseconds
99.99% <= 17 milliseconds
100.00% <= 17 milliseconds
35075.41 requests per second

====== PING_BULK ======
  100000 requests completed in 2.96 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

67.23% <= 1 milliseconds
93.49% <= 2 milliseconds
98.71% <= 3 milliseconds
99.36% <= 4 milliseconds
99.63% <= 5 milliseconds
99.79% <= 6 milliseconds
99.85% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
33760.97 requests per second

====== SET ======
  100000 requests completed in 2.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

66.33% <= 1 milliseconds
92.65% <= 2 milliseconds
98.56% <= 3 milliseconds
99.27% <= 4 milliseconds
99.49% <= 5 milliseconds
99.74% <= 6 milliseconds
99.97% <= 7 milliseconds
100.00% <= 7 milliseconds
35486.16 requests per second

====== GET ======
  100000 requests completed in 2.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

70.02% <= 1 milliseconds
93.25% <= 2 milliseconds
98.65% <= 3 milliseconds
99.39% <= 4 milliseconds
99.78% <= 5 milliseconds
99.87% <= 6 milliseconds
99.96% <= 7 milliseconds
100.00% <= 7 milliseconds
36010.08 requests per second

====== INCR ======
  100000 requests completed in 2.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

71.57% <= 1 milliseconds
94.90% <= 2 milliseconds
99.48% <= 3 milliseconds
99.87% <= 4 milliseconds
99.96% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 7 milliseconds
37850.11 requests per second

====== LPUSH ======
  100000 requests completed in 2.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

64.07% <= 1 milliseconds
91.53% <= 2 milliseconds
98.83% <= 3 milliseconds
99.78% <= 4 milliseconds
99.92% <= 5 milliseconds
100.00% <= 5 milliseconds
34650.04 requests per second

====== RPUSH ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

68.65% <= 1 milliseconds
94.51% <= 2 milliseconds
99.54% <= 3 milliseconds
99.94% <= 4 milliseconds
100.00% <= 5 milliseconds
37537.54 requests per second

====== LPOP ======
  100000 requests completed in 2.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

79.23% <= 1 milliseconds
95.21% <= 2 milliseconds
99.48% <= 3 milliseconds
99.88% <= 4 milliseconds
99.96% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 6 milliseconds
42936.88 requests per second

====== RPOP ======
  100000 requests completed in 2.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

67.26% <= 1 milliseconds
93.30% <= 2 milliseconds
99.34% <= 3 milliseconds
99.90% <= 4 milliseconds
100.00% <= 5 milliseconds
37216.23 requests per second

====== SADD ======
  100000 requests completed in 2.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

67.90% <= 1 milliseconds
93.57% <= 2 milliseconds
99.30% <= 3 milliseconds
99.80% <= 4 milliseconds
99.94% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
36710.72 requests per second

====== HSET ======
  100000 requests completed in 2.93 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

63.84% <= 1 milliseconds
90.99% <= 2 milliseconds
98.14% <= 3 milliseconds
99.54% <= 4 milliseconds
99.90% <= 5 milliseconds
99.93% <= 6 milliseconds
99.96% <= 7 milliseconds
100.00% <= 7 milliseconds
34164.67 requests per second

====== SPOP ======
  100000 requests completed in 2.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

67.09% <= 1 milliseconds
92.08% <= 2 milliseconds
98.47% <= 3 milliseconds
99.70% <= 4 milliseconds
99.92% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 6 milliseconds
35161.74 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.98 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

60.69% <= 1 milliseconds
89.39% <= 2 milliseconds
97.86% <= 3 milliseconds
99.55% <= 4 milliseconds
99.85% <= 5 milliseconds
99.94% <= 6 milliseconds
99.96% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
33579.59 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 4.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

26.70% <= 1 milliseconds
70.93% <= 2 milliseconds
89.76% <= 3 milliseconds
96.78% <= 4 milliseconds
99.01% <= 5 milliseconds
99.71% <= 6 milliseconds
99.87% <= 7 milliseconds
99.98% <= 8 milliseconds
100.00% <= 10 milliseconds
100.00% <= 10 milliseconds
20842.02 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 10.23 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
35.20% <= 2 milliseconds
71.05% <= 3 milliseconds
93.81% <= 4 milliseconds
98.27% <= 5 milliseconds
99.42% <= 6 milliseconds
99.74% <= 7 milliseconds
99.93% <= 8 milliseconds
99.98% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 10 milliseconds
9778.04 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 15.92 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.20% <= 2 milliseconds
25.30% <= 3 milliseconds
57.76% <= 4 milliseconds
81.37% <= 5 milliseconds
92.11% <= 6 milliseconds
96.43% <= 7 milliseconds
98.10% <= 8 milliseconds
98.92% <= 9 milliseconds
99.36% <= 10 milliseconds
99.64% <= 11 milliseconds
99.78% <= 12 milliseconds
99.83% <= 13 milliseconds
99.85% <= 14 milliseconds
99.88% <= 15 milliseconds
99.90% <= 16 milliseconds
99.93% <= 17 milliseconds
99.95% <= 18 milliseconds
99.96% <= 19 milliseconds
99.97% <= 20 milliseconds
99.98% <= 21 milliseconds
99.99% <= 23 milliseconds
99.99% <= 24 milliseconds
99.99% <= 25 milliseconds
100.00% <= 25 milliseconds
6281.80 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 19.02 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
0.07% <= 2 milliseconds
7.59% <= 3 milliseconds
33.55% <= 4 milliseconds
64.10% <= 5 milliseconds
83.86% <= 6 milliseconds
92.30% <= 7 milliseconds
96.10% <= 8 milliseconds
97.73% <= 9 milliseconds
98.54% <= 10 milliseconds
99.13% <= 11 milliseconds
99.53% <= 12 milliseconds
99.71% <= 13 milliseconds
99.80% <= 14 milliseconds
99.86% <= 15 milliseconds
99.89% <= 16 milliseconds
99.92% <= 17 milliseconds
99.93% <= 18 milliseconds
99.95% <= 19 milliseconds
99.97% <= 20 milliseconds
99.98% <= 21 milliseconds
99.98% <= 22 milliseconds
99.99% <= 23 milliseconds
99.99% <= 24 milliseconds
100.00% <= 26 milliseconds
100.00% <= 26 milliseconds
5258.45 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 3.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

21.80% <= 1 milliseconds
67.94% <= 2 milliseconds
91.51% <= 3 milliseconds
97.97% <= 4 milliseconds
99.28% <= 5 milliseconds
99.70% <= 6 milliseconds
99.83% <= 7 milliseconds
99.92% <= 8 milliseconds
99.94% <= 9 milliseconds
99.96% <= 10 milliseconds
99.97% <= 11 milliseconds
99.98% <= 12 milliseconds
100.00% <= 12 milliseconds
27107.62 requests per second