redis_performance/5workers/redis-performance_without_stress.txt
====== PING_INLINE ======
  100000 requests completed in 1.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.98% <= 1 milliseconds
99.38% <= 2 milliseconds
99.68% <= 3 milliseconds
99.93% <= 4 milliseconds
99.95% <= 5 milliseconds
99.95% <= 6 milliseconds
100.00% <= 6 milliseconds
57971.02 requests per second

====== PING_BULK ======
  100000 requests completed in 1.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

92.23% <= 1 milliseconds
98.53% <= 2 milliseconds
99.30% <= 3 milliseconds
99.50% <= 4 milliseconds
99.79% <= 5 milliseconds
99.84% <= 6 milliseconds
100.00% <= 6 milliseconds
50301.81 requests per second

====== SET ======
  100000 requests completed in 1.87 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

93.73% <= 1 milliseconds
99.39% <= 2 milliseconds
99.61% <= 3 milliseconds
99.74% <= 4 milliseconds
99.90% <= 5 milliseconds
100.00% <= 5 milliseconds
53533.19 requests per second

====== GET ======
  100000 requests completed in 1.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.15% <= 1 milliseconds
99.64% <= 2 milliseconds
99.79% <= 3 milliseconds
99.89% <= 4 milliseconds
99.90% <= 5 milliseconds
99.95% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
57836.90 requests per second

====== INCR ======
  100000 requests completed in 1.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.66% <= 1 milliseconds
99.69% <= 2 milliseconds
99.71% <= 3 milliseconds
99.79% <= 4 milliseconds
99.91% <= 5 milliseconds
99.95% <= 7 milliseconds
100.00% <= 7 milliseconds
58719.91 requests per second

====== LPUSH ======
  100000 requests completed in 1.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.70% <= 1 milliseconds
99.63% <= 2 milliseconds
99.83% <= 3 milliseconds
99.87% <= 4 milliseconds
99.88% <= 5 milliseconds
99.95% <= 6 milliseconds
99.97% <= 7 milliseconds
100.00% <= 7 milliseconds
60204.70 requests per second

====== RPUSH ======
  100000 requests completed in 1.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.04% <= 1 milliseconds
99.83% <= 2 milliseconds
99.90% <= 4 milliseconds
99.95% <= 5 milliseconds
100.00% <= 5 milliseconds
61050.06 requests per second

====== LPOP ======
  100000 requests completed in 1.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.84% <= 1 milliseconds
99.78% <= 2 milliseconds
99.89% <= 3 milliseconds
99.90% <= 5 milliseconds
99.95% <= 7 milliseconds
100.00% <= 7 milliseconds
60716.46 requests per second

====== RPOP ======
  100000 requests completed in 1.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.36% <= 1 milliseconds
99.93% <= 2 milliseconds
100.00% <= 2 milliseconds
61500.61 requests per second

====== SADD ======
  100000 requests completed in 1.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.19% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
60790.27 requests per second

====== HSET ======
  100000 requests completed in 1.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.16% <= 1 milliseconds
99.88% <= 2 milliseconds
99.95% <= 6 milliseconds
100.00% <= 6 milliseconds
61500.61 requests per second

====== SPOP ======
  100000 requests completed in 1.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.86% <= 1 milliseconds
99.88% <= 2 milliseconds
99.96% <= 5 milliseconds
100.00% <= 5 milliseconds
59630.29 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 1.62 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.45% <= 1 milliseconds
99.91% <= 2 milliseconds
100.00% <= 2 milliseconds
61690.31 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 2.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

62.57% <= 1 milliseconds
99.13% <= 2 milliseconds
99.90% <= 3 milliseconds
99.97% <= 4 milliseconds
100.00% <= 4 milliseconds
35855.14 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 6.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
92.43% <= 2 milliseconds
99.35% <= 3 milliseconds
99.85% <= 4 milliseconds
99.94% <= 5 milliseconds
99.96% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
14954.39 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 8.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
6.79% <= 2 milliseconds
98.19% <= 3 milliseconds
99.57% <= 4 milliseconds
99.83% <= 5 milliseconds
99.92% <= 6 milliseconds
99.97% <= 7 milliseconds
99.98% <= 8 milliseconds
100.00% <= 8 milliseconds
11257.46 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 11.51 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.02% <= 2 milliseconds
77.40% <= 3 milliseconds
98.66% <= 4 milliseconds
99.46% <= 5 milliseconds
99.70% <= 6 milliseconds
99.85% <= 7 milliseconds
99.93% <= 8 milliseconds
99.96% <= 9 milliseconds
99.98% <= 10 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
8686.59 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.08 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

55.34% <= 1 milliseconds
99.41% <= 2 milliseconds
99.92% <= 3 milliseconds
99.98% <= 4 milliseconds
100.00% <= 4 milliseconds
48146.37 requests per second